src/test/resources/nl/clockwork/ebms/soap/GetUnprocessedMessageIds.xml

<!--

    Copyright 2011 Clockwork

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

      http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.

-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.ordina.nl/ebms/2.18">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:getUnprocessedMessageIds>
         <messageFilter>
            <cpaId>[[${cpaId}]]</cpaId>
            <fromParty>
               <partyId>[[${partyType}]]:[[${fromPartyId}]]</partyId>
               <role>[[${fromRole}]]</role>
            </fromParty>
            <toParty>
               <partyId>[[${partyType}]]:[[${toPartyId}]]</partyId>
               <role>[[${toRole}]]</role>
            </toParty>
            <service>[[${serviceType}]]:[[${service}]]</service>
            <action>[[${action}]]</action>
         </messageFilter>
      </ns:getUnprocessedMessageIds>
   </soapenv:Body>
</soapenv:Envelope>